app/views/comments/index.html.erb


<h2><%= @comments.first.post.title %></h2>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

    <%= thing.body %><br>
    <%= pluralize(thing.votes.count, "point") %> Written by: <%= thing.user.name %> <%= thing.created_at.strftime("on %m/%d/%Y at %I:%M%p") %>
---
INSERT INTO "votes" ("votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["votable_type", "Comment"], ["votable_id", 1], ["created_at", "2017-05-30 03:10:12.273876"], ["updated_at", "2017-05-30 03:10:12.273876"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]