app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---

<p>You have <%= current_user.posts.count %> posts!

SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
---

<p>You have <%= current_user.comments.count %> comments!