app/views/welcome/comment.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <%= comment.body %><br>
    <%= pluralize(comment.votes.count, "point") %> Written by: <%= comment.user.name %> <%= comment.created_at.strftime("on %m/%d/%Y at %I:%M%p") %>