app/views/welcome/index.html.erb


    <p class="small"><%= pluralize(post.votes.count, "point") %> by <%= post.user.name %> <%= distance_of_time_in_words(post.updated_at, DateTime.now) %> ago <span class="hide">| hide |</span> <%= link_to "#{pluralize(post.comments.count, "comment")}", user_post_comments_path(post.user, post) %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 15]]