app/views/posts/index.html.erb

<h1><%= @posts.first.user.name %>'s Posts</h1>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]