app/controllers/comments_controller.rb

  def index
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

  def new
    @comment = Comment.new
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

  def create
    @post = Post.find(params[:post_id])
    @comment = Comment.new(params.require(:comment).permit(:body).merge(user: current_user, post: @post))
    if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "WEEEEEEEEEEE"], ["user_id", 1], ["post_id", 15], ["created_at", "2017-05-30 02:09:41.429045"], ["updated_at", "2017-05-30 02:09:41.429045"]]

  def upvote
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
    @comment.votes.create
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["votable_type", "Comment"], ["votable_id", 1], ["created_at", "2017-05-30 03:10:12.273876"], ["updated_at", "2017-05-30 03:10:12.273876"]]