app/controllers/posts_controller.rb

  def index
    @posts = User.find(params[:user_id]).posts
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params.merge(user: current_user))
    if @post.save
---
INSERT INTO "posts" ("title", "url", "text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "First post"], ["url", "www.facebook.com"], ["text", ""], ["user_id", 1], ["created_at", "2017-05-29 22:34:06.413228"], ["updated_at", "2017-05-29 22:34:06.413228"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Testing????"], ["body", "Learning!!!!!"], ["updated_at", "2017-05-29 23:24:49.079962"], ["id", 3]]

  def upvote
    @post = Post.find(params[:id])
    @post.votes.create(value: 1)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
INSERT INTO "votes" ("value", "votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", 1], ["votable_type", "Post"], ["votable_id", 15], ["created_at", "2017-05-31 01:41:05.633159"], ["updated_at", "2017-05-31 01:41:05.633159"]]