app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "a"], ["LIMIT", 1]]
---
  def create
    user = User.find_by_name(params[:name])