app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "quyen"]]
---
  def create
    user = User.find_by_username(params[:username])