app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "a"], ["password_digest", "$2a$10$ic/bHgv7Q/2KwRvkUzthDe05Z6eizAUX33/hzbc6K4bLDb9HdwG2e"], ["created_at", "2017-05-29 21:13:46.274560"], ["updated_at", "2017-05-29 21:13:46.274560"]]