app/controllers/welcome_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."updated_at" ASC, "posts"."desc" ASC
---
  def index
    @posts = Post.all.order('updated_at DESC')

SELECT "posts".* FROM "posts" WHERE (updated_at > '2017-05-29 23:50:10.415456')
---
  def new
    @posts = Post.where('updated_at > ?', 30.minutes.ago)

SELECT "posts".* FROM "posts"
---
  def ask
    @posts = Post.all.select {|post| post.title.start_with?("Ask")}

SELECT "posts".* FROM "posts"
---
  def link
    @posts = Post.all.select {|post| post.url.include?('.com' || '.net' || '.org')}

SELECT "posts".* FROM "posts"
---
  def text
    @posts = Post.all.reject {|post| post.url.include?('.com' || '.net' || '.org')}

SELECT "comments".* FROM "comments"
---
  def comments
    @comments = Comment.all